In [33]:
#Exercice 1
# Question 1, Creation du DataFrame
import pandas as pd
from pandas import Series, DataFrame
filename = './data_1/nyc-parking-violations-2020.csv'
df = pd.read_csv(filename, usecols = ['Date First Observed', 'Plate ID', 'Registration State', 'Issue Date', \
                                      'Vehicle Make', 'Street Name', 'Vehicle Color'])
df.columns

Index(['Plate ID', 'Registration State', 'Issue Date', 'Vehicle Make',
       'Street Name', 'Date First Observed', 'Vehicle Color'],
      dtype='object')

In [34]:
# Pour chercher le type
df.dtypes

Plate ID               object
Registration State     object
Issue Date             object
Vehicle Make           object
Street Name            object
Date First Observed     int64
Vehicle Color          object
dtype: object

In [35]:
# Changer Issue Date en date
df['Issue Date'] = pd.to_datetime(df['Issue Date'])
df.dtypes

Plate ID                       object
Registration State             object
Issue Date             datetime64[ns]
Vehicle Make                   object
Street Name                    object
Date First Observed             int64
Vehicle Color                  object
dtype: object

In [36]:
# Question 2, Definition de l'index Issue Date
df.set_index('Issue Date',inplace = True)
df.head()

,Plate ID,Registration State,Vehicle Make,Street Name,Date First Observed,Vehicle Color
Issue Date,,,,,,
1972-05-08,J58JKX,NJ,HONDA,43 ST,0,BK
1977-08-29,KRE6058,PA,ME/BE,UNION ST,0,BLK
1988-10-03,444326R,NJ,LEXUS,CLERMONT AVENUE,0,BLACK
1990-01-03,F728330,OH,CHEVR,DIVISION AVE,0,NaN
1990-02-14,FMY9090,NY,JEEP,GRAND ST,0,GREY

In [37]:
# Question 3, Les Marques de voiture plus susceptibles
df.loc[((df.index.month == 1) & (df.index.day == 2)),:]['Vehicle Make'].value_counts().head(3)

TOYOT    3833
HONDA    3607
FORD     3173
Name: Vehicle Make, dtype: int64

In [38]:
#Question 4, Les cinq rues dont les voitures ont reccu plus de contraventions
df.loc['2019-10-03',:]['Street Name'].value_counts().head()

Broadway    726
3rd Ave     586
2nd Ave     410
5th Ave     328
1st Ave     317
Name: Street Name, dtype: int64

In [39]:
# Question 5, Definition de l'index colunne Vehicle Color
df.set_index('Vehicle Color',inplace = True)
df.head()

,Plate ID,Registration State,Vehicle Make,Street Name,Date First Observed
Vehicle Color,,,,,
BK,J58JKX,NJ,HONDA,43 ST,0
BLK,KRE6058,PA,ME/BE,UNION ST,0
BLACK,444326R,NJ,LEXUS,CLERMONT AVENUE,0
NaN,F728330,OH,CHEVR,DIVISION AVE,0
GREY,FMY9090,NY,JEEP,GRAND ST,0

In [40]:
# Question 6, La marque de voiture courante la plus santionees
df.loc[['RED','BLUE'],:]['Vehicle Make'].value_counts().head(1)

HONDA    39353
Name: Vehicle Make, dtype: int64

In [41]:
#Exercice 2

#Question 1, Creation du DataFrame
df = pd.read_csv('./data_1/sat-scores.csv' , usecols=['Year','State.Code','Total.Math','Total.Test-takers','Total.Verbal'] , header=0 )
df.head

<bound method NDFrame.head of      Year State.Code  Total.Math  Total.Test-takers  Total.Verbal
0    2005         AL         559               3985           567
1    2005         AK         519               3996           523
2    2005         AZ         530              18184           526
3    2005         AR         552               1600           563
4    2005         CA         522             186552           504
..    ...        ...         ...                ...           ...
572  2015         VA         517              59621           518
573  2015         WA         511              44423           502
574  2015         WV         500               2501           509
575  2015         WI         606               2277           591
576  2015         WY         587                181           588

[577 rows x 5 columns]>

In [43]:
#Question 2, Creation d'un multi-index basse sur l'annee et le code d'Etat
df.set_index(['Year','State.Code'],inplace = True)
df.head()

                 Total.Math  Total.Test-takers  Total.Verbal
Year State.Code
2005 AL                 559               3985           567
     AK                 519               3996           523
     AZ                 530              18184           526
     AR                 552               1600           563
     CA                 522             186552           504

In [44]:
#Question 3, La quantite de personne qui ont passee le SAT en 2005
df.loc[2005,'Total.Test-takers'].sum()

1344824

In [45]:
#Question 4, Le score moyenne en mathematiques au SAT 2010
df.loc[(2010,['NY','NJ','MA','IL']),'Total.Math'].mean()

535.25

In [46]:
#Question 5, Le score moyenne au SAT  oral en 2012 et 2015
df.loc[([2012 , 2013, 2014, 2015],['AZ','CA','TX']),'Total.Verbal'].mean()

497.3333333333333